; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-6-3)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	person1 - person
	person2 - person
	person3 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city2)
	(fuel-level plane1 fl0)
	(at plane2 city3)
	(fuel-level plane2 fl3)
	(at plane3 city4)
	(fuel-level plane3 fl2)
	(at plane4 city3)
	(fuel-level plane4 fl3)
	(at plane5 city2)
	(fuel-level plane5 fl4)
	(at plane6 city4)
	(fuel-level plane6 fl5)
	(at person1 city4)
	(at person2 city3)
	(at person3 city1)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane1 city1)
	(at person1 city2)
	(at person2 city0)
	(at person3 city2)
	))

)

; plan
1. (board person1 plane6 city4)
   deleted: (at person1 city4)
   added: (in person1 plane6)
   goals met: 0 of 4
2. (zoom plane6 city4 city2 fl5 fl4 fl3)
   deleted: (at plane6 city4) (fuel-level plane6 fl5)
   added: (at plane6 city2) (fuel-level plane6 fl3)
   goals met: 0 of 4
3. (debark person1 plane6 city2)
   deleted: (in person1 plane6)
   added: (at person1 city2)
   goals met: 1 of 4
4. (board person2 plane4 city3)
   deleted: (at person2 city3)
   added: (in person2 plane4)
   goals met: 1 of 4
5. (zoom plane4 city3 city0 fl3 fl2 fl1)
   deleted: (at plane4 city3) (fuel-level plane4 fl3)
   added: (at plane4 city0) (fuel-level plane4 fl1)
   goals met: 1 of 4
6. (debark person2 plane4 city0)
   deleted: (in person2 plane4)
   added: (at person2 city0)
   goals met: 2 of 4
7. (zoom plane2 city3 city1 fl3 fl2 fl1)
   deleted: (at plane2 city3) (fuel-level plane2 fl3)
   added: (at plane2 city1) (fuel-level plane2 fl1)
   goals met: 2 of 4
8. (board person3 plane2 city1)
   deleted: (at person3 city1)
   added: (in person3 plane2)
   goals met: 2 of 4
9. (fly plane2 city1 city2 fl1 fl0)
   deleted: (at plane2 city1) (fuel-level plane2 fl1)
   added: (at plane2 city2) (fuel-level plane2 fl0)
   goals met: 2 of 4
10. (debark person3 plane2 city2)
   deleted: (in person3 plane2)
   added: (at person3 city2)
   goals met: 3 of 4
11. (refuel plane1 city2 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 3 of 4
12. (fly plane1 city2 city1 fl1 fl0)
   deleted: (at plane1 city2) (fuel-level plane1 fl1)
   added: (at plane1 city1) (fuel-level plane1 fl0)
   goals met: 4 of 4
